/**
 * Η κλάση αυτή αφορά σε ένα θερμαντικό σώμα, το οποίο θα ξεκινάει στους 15 
 * βαθμούς κελσίου. Η θερμοκρασία του θα μπορεί να αυξηθεί ή να μειωθεί κατά 
 * ένα βήμα, το οποίο αρχικά θα είναι 5 βαθμοί κελσίου. Η ρύθμιση της 
 * θερμοκρασίας δεν θα πρέπει να βγαίνει εκτός ενός κατώτερου και ενός ανώτερου 
 * ορίου. 
 *
 */
public class Heater {    
    /* 
    O κατασκευαστής θα δέχεται δύο παραμέτρους. Η πρώτη 
    παράμετρος θα αφορά στην ελάχιστη και η δεύτερη στην μέγιστη θερμοκρασία 
    στην οποία επιτρέπεται να ρυθμιστεί το θερμαντικό σώμα. 
    */

    // Η μέθοδος αυτή θα αυξάνει την θερμοκρασία σύμφωνα με το βήμα
    public void warmer() {
    }

    // Η μέθοδος αυτή θα μειώνει την θερμοκρασία σύμφωνα με το βήμα
    public void colder() {
    }

    //Η μέθοδος αυτή θα αλλάζει το βήμα
    public void setIncrement(double step) {
    }

    // η μέθοδος αυτή θα επιστρέφει την ρύθμιση της θερμοκρασίας
    public double getTemperature() {
    }
}