/**
 * Αυτή η κλάση αναπαριστά ένα ορθογώνιο.
 *
 */
public class Rectangle {

    /*
    O κατασκευαστής θα δέχεται δύο παραμέτρους. Η πρώτη
    παράμετρος θα αφορά το μήκος και η δεύτερη το πλάτος του ορθογωνίου.
    */

    /* Μέθοδος που θα επιστρέφει την περίμετρο του ορθογωνίου */
    public double getPerimeter() {
    }

    /* Μέθοδος που θα επιστρέφει τo εμβαδό του ορθογωνίου */
    public double getArea() {
    }

    /* Μέθοδος που αλλάζει το μήκος του ορθογωνίου */
    public void setWidth(double x) {
    }

    /* Μέθοδος που αλλάζει το πλάτος του ορθογωνίου */
    public void setHeight(double x) {
    }

    /* Μέθοδος που επιστρέφει το μήκος του ορθογωνίου */
    public double getWidth() {
    }

    /* Μέθοδος που επιστρέφει το πλάτος του ορθογωνίου */
    public double getHeight() {

    }

}